20230103T092741--factoring__algebra_math.org
#+title:      factoring
#+date:       [2023-01-03 Tue 09:27]
#+filetags:   :algebra:math:
#+identifier: 20230103T092741

* breaking things down to their factors
\begin{align*}
30           &= 6 \cdot 5 = 2 \cdot 3 \cdot 5\\
x^2 + 5x + 6 &= (x+2)(x+3)
\end{align*}

- when things are added they are called terms
- when things are multiplied they are called factors

* pull out the greates common factor

  \begin{equation*}
  15 + 25x = 5(3 + 5x)
  \end{equation*}

  \begin{flalign*}
  x^{2}y + y^{2}x^3 = x^{2}y(1 + xy)\\
                    = x^{2}y(1 + xy)
  \end{flalign*}

* factoring by grouping
- if the equation has 4 term or could be split up into 4 terms, it maybe a good canidate for factoring by grouping
  
\begin{flalign*}
x^3 + 3x^2 + 4x + 12 &= x^2(x + 3) + 4(x + 3)\\
                     &= (x^2 + 4)(x + 3)
\end{flalign*}

** examples

- ex1:
  \begin{flalign*}
  x^3 + 2x^2 + 3x + 6 &= x^2(x + 2) + 3(x + 2)\\
                      &= (x + 2)(x^2 + 3)
  \end{flalign*}
  
- ex2:
  - find a combination of number that add to -14 but multiply to 40 which is (5 \times 8)
    
  \begin{flalign*}
  5x^2 - 14x + 8 &= 5x^2 - 4x - 10x + 8\\
                 &= x(5x -4) - 2(5x - 4)\\
                 &= (5x - 4)(x - 2)
  \end{flalign*}

* factoring by quadratics
- a quadratic is of the form $ax^2 + bx + c$
- find a pair of number that add to b but multiply to c
  
\begin{equation*}
x^2 - 6x + 8 &= (x-2)(x-4)
\end{equation*}

- ex:
  - convert it to 4 terms then use factoring by grouping
    - multiply a by c
      - $10 \times -6$
    - find to numbers that add to b but multiply to (a * b)
      - $-4 + 15$
  \begin{flalign*}
  10x^2 + 11x - 6 &= 10x^2 -4x + 15x -6\\
                  &= 2x(5x -2) + 3(5x - 2)\\
                  &= (2x + 3)(5x -2)
  \end{flalign*}
  
* difference of squares
\begin{equation*}
a^2 - b^2 = (a + b)(a - b)
\end{equation*}

- ex:
  \begin{flalign*}
  x^2 - 16 &= x^2 - 4^2\\
           &= (x + 4)(x - 4) 
  \end{flalign*}

- ex:
  \begin{flalign*}
  9p^2 - 1 &= (3p)^2 - 1^2\\
           &= (3p + 1)(3p - 1)
  \end{flalign*}

- note:
  - some of squares does not work
  \begin{equation*}
  x^2 + 4 \neq x^2 + 2^2
  \end{equation*}

* difference or sum of cubes
\begin{align*}
a^3 - b^3 &= (a - b)(a^2 + ab + b^2)\\
a^3 + b^3 &= (a + b)(a^2 - ab + b^2)
\end{align*}

** examples

- ex:
  \begin{flalign*}
  y^3 + 27 &= y^3 + 3^3\\
           &= (y + 3)(y^2 - 3y + 3^2)
  \end{flalign*}

